zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxSdmmc_regdef.h
/** \brief Maximum Current Capabilities Register 0 to 31 */
typedef struct _Ifx_SDMMC_CURR_CAPABILITIES1_Bits
{
    Ifx_UReg_32Bit MAX_CUR_33V:8;     /**< \brief [7:0] Maximum Current for 3.3 V - MAX_CUR_33V (r) */
    Ifx_UReg_32Bit MAX_CUR_30V:8;     /**< \brief [15:8] Maximum Current for 3.0 V - MAX_CUR_30V (r) */
    Ifx_UReg_32Bit MAX_CUR_18V:8;     /**< \brief [23:16] Maximum Current for 1.8 V - MAX_CUR_18V (r) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_SDMMC_CURR_CAPABILITIES1_Bits;

/** \brief Maximum Current Capabilities Register 32 to 63 */
typedef struct _Ifx_SDMMC_CURR_CAPABILITIES2_Bits
{
    Ifx_UReg_32Bit MAX_CUR_VDD2_18V:8;    /**< \brief [7:0] Maximum Current for 1.8 V VDD2 - MAX_CUR_VDD2_18V (r) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_SDMMC_CURR_CAPABILITIES2_Bits;

/** \brief Embedded Control register */
typedef struct _Ifx_SDMMC_EMBEDDED_CTRL_Bits
{
    Ifx_UReg_32Bit NUM_CLK_PIN:3;     /**< \brief [2:0] Number of Clock Pins (SD Mode) - NUM_CLK_PIN (r) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit NUM_INT_PIN:2;     /**< \brief [5:4] Number of Interrupt Input Pins - NUM_INT_PIN (r) */
    Ifx_UReg_32Bit reserved_6:2;      /**< \brief [7:6] \internal Reserved */
    Ifx_UReg_32Bit BUS_WIDTH_PRESET:7;    /**< \brief [14:8] Bus Width Preset (SD Mode) - BUS_WIDTH_PRESET (r) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit CLK_PIN_SEL:3;     /**< \brief [18:16] Clock Pin Select (SD Mode) - CLK_PIN_SEL (rw) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit INT_PIN_SEL:3;     /**< \brief [22:20] Interrupt Pin Select - INT_PIN_SEL (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit BACK_END_PWR_CTRL:7;    /**< \brief [30:24] Back-End Power Control (SD Mode) - BACK_END_PWR_CTRL (rw) */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_SDMMC_EMBEDDED_CTRL_Bits;

/** \brief eMMC Control register */
typedef struct _Ifx_SDMMC_EMMC_CTRL_Bits
{
    Ifx_UReg_16Bit CARD_IS_EMMC:1;    /**< \brief [0:0] eMMC Card present - CARD_IS_EMMC (rw) */
    Ifx_UReg_16Bit DISABLE_DATA_CRC_CHK:1;    /**< \brief [1:1] Disable Data CRC Check - DISABLE_DATA_CRC_CHK (rw) */
    Ifx_UReg_16Bit reserved_2:6;      /**< \brief [7:2] \internal Reserved */
    Ifx_UReg_16Bit ENH_STROBE_ENABLE:1;    /**< \brief [8:8] Enhanced Strobe Enable - ENH_STROBE_ENABLE (rw) */
    Ifx_UReg_16Bit CQE_ALGO_SEL:1;    /**< \brief [9:9] Scheduler algorithm selected for execution - CQE_ALGO_SEL (rw) */
    Ifx_UReg_16Bit reserved_10:6;     /**< \brief [15:10] \internal Reserved */
} Ifx_SDMMC_EMMC_CTRL_Bits;

/** \brief Error Interrupt Signal Enable Register */
typedef struct _Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits
{
    Ifx_UReg_16Bit CMD_TOUT_ERR_SIGNAL_EN:1;    /**< \brief [0:0] Command Timeout Error Signal Enable (SD/eMMC Mode only) - CMD_TOUT_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CMD_CRC_ERR_SIGNAL_EN:1;    /**< \brief [1:1] Command CRC Error Signal Enable (SD/eMMC Mode only) - CMD_CRC_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CMD_END_BIT_ERR_SIGNAL_EN:1;    /**< \brief [2:2] Command End Bit Error Signal Enable (SD/eMMC Mode only) - CMD_END_BIT_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CMD_IDX_ERR_SIGNAL_EN:1;    /**< \brief [3:3] Command Index Error Signal Enable (SD/eMMC Mode only) - CMD_IDX_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit DATA_TOUT_ERR_SIGNAL_EN:1;    /**< \brief [4:4] Data Timeout Error Signal Enable (SD/eMMC Mode only) - DATA_TOUT_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit DATA_CRC_ERR_SIGNAL_EN:1;    /**< \brief [5:5] Data CRC Error Signal Enable (SD/eMMC Mode only) - DATA_CRC_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit DATA_END_BIT_ERR_SIGNAL_EN:1;    /**< \brief [6:6] Data End Bit Error Signal Enable (SD/eMMC Mode only) - DATA_END_BIT_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit CUR_LMT_ERR_SIGNAL_EN:1;    /**< \brief [7:7] Current Limit Error Signal Enable - CUR_LMT_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit AUTO_CMD_ERR_SIGNAL_EN:1;    /**< \brief [8:8] Auto CMD Error Signal Enable (SD/eMMC Mode only) - AUTO_CMD_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit ADMA_ERR_SIGNAL_EN:1;    /**< \brief [9:9] ADMA Error Signal Enable - ADMA_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit TUNING_ERR_SIGNAL_EN:1;    /**< \brief [10:10] Tuning Error Signal Enable - TUNING_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit RESP_ERR_SIGNAL_EN:1;    /**< \brief [11:11] Response Error Signal Enable (SD Mode only) - RESP_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit BOOT_ACK_ERR_SIGNAL_EN:1;    /**< \brief [12:12] Boot Acknowledgment Error (eMMC Mode only). - BOOT_ACK_ERR_SIGNAL_EN (rw) */
    Ifx_UReg_16Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_16Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_ERROR_INT_SIGNAL_EN_Bits;

/** \brief Error Interrupt Status Register */
typedef struct _Ifx_SDMMC_ERROR_INT_STAT_Bits
{
    Ifx_UReg_16Bit CMD_TOUT_ERR:1;    /**< \brief [0:0] Command Timeout Error (SD/eMMC Mode only) - CMD_TOUT_ERR (rw) */
    Ifx_UReg_16Bit CMD_CRC_ERR:1;     /**< \brief [1:1] Command CRC Error (SD/eMMC Mode only) - CMD_CRC_ERR (rw) */
    Ifx_UReg_16Bit CMD_END_BIT_ERR:1;    /**< \brief [2:2] Command End Bit Error (SD/eMMC Mode only) - CMD_END_BIT_ERR (rw) */
    Ifx_UReg_16Bit CMD_IDX_ERR:1;     /**< \brief [3:3] Command Index Error (SD/eMMC Mode only) - CMD_IDX_ERR (rw) */
    Ifx_UReg_16Bit DATA_TOUT_ERR:1;    /**< \brief [4:4] Data Timeout Error (SD/eMMC Mode only) - DATA_TOUT_ERR (rw) */
    Ifx_UReg_16Bit DATA_CRC_ERR:1;    /**< \brief [5:5] Data CRC Error (SD/eMMC Mode only). - DATA_CRC_ERR (rw) */
    Ifx_UReg_16Bit DATA_END_BIT_ERR:1;    /**< \brief [6:6] Data End Bit Error (SD/eMMC Mode only) - DATA_END_BIT_ERR (rw) */
    Ifx_UReg_16Bit CUR_LMT_ERR:1;     /**< \brief [7:7] Current Limit Error - CUR_LMT_ERR (rw) */
    Ifx_UReg_16Bit AUTO_CMD_ERR:1;    /**< \brief [8:8] Auto CMD Error (SD/eMMC Mode only) - AUTO_CMD_ERR (rw) */
    Ifx_UReg_16Bit ADMA_ERR:1;        /**< \brief [9:9] ADMA Error - ADMA_ERR (rw) */
    Ifx_UReg_16Bit TUNING_ERR:1;      /**< \brief [10:10] Tuning Error - TUNING_ERR (rw) */
    Ifx_UReg_16Bit RESP_ERR:1;        /**< \brief [11:11] Response Error (SD Mode only) - RESP_ERR (rw) */
    Ifx_UReg_16Bit BOOT_ACK_ERR:1;    /**< \brief [12:12] Boot Acknowledgement Error (eMMC Mode only) - BOOT_ACK_ERR (rw) */
    Ifx_UReg_16Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_16Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_ERROR_INT_STAT_Bits;

/** \brief Error Interrupt Status Enable Register */
typedef struct _Ifx_SDMMC_ERROR_INT_STAT_EN_Bits
{
    Ifx_UReg_16Bit CMD_TOUT_ERR_STAT_EN:1;    /**< \brief [0:0] Command Timeout Error Status Enable (SD/eMMC Mode only). - CMD_TOUT_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit CMD_CRC_ERR_STAT_EN:1;    /**< \brief [1:1] Command CRC Error Status Enable (SD/eMMC Mode only) - CMD_CRC_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit CMD_END_BIT_ERR_STAT_EN:1;    /**< \brief [2:2] Command End Bit Error Status Enable (SD/eMMC Mode only) - CMD_END_BIT_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit CMD_IDX_ERR_STAT_EN:1;    /**< \brief [3:3] Command Index Error Status Enable (SD/eMMC Mode only) - CMD_IDX_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit DATA_TOUT_ERR_STAT_EN:1;    /**< \brief [4:4] Data Timeout Error Status Enable (SD/eMMC Mode only) - DATA_TOUT_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit DATA_CRC_ERR_STAT_EN:1;    /**< \brief [5:5] Data CRC Error Status Enable (SD/eMMC Mode only) - DATA_CRC_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit DATA_END_BIT_ERR_STAT_EN:1;    /**< \brief [6:6] Data End Bit Error Status Enable (SD/eMMC Mode only). - DATA_END_BIT_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit CUR_LMT_ERR_STAT_EN:1;    /**< \brief [7:7] Current Limit Error Status Enable - CUR_LMT_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit AUTO_CMD_ERR_STAT_EN:1;    /**< \brief [8:8] Auto CMD Error Status Enable (SD/eMMC Mode only). - AUTO_CMD_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit ADMA_ERR_STAT_EN:1;    /**< \brief [9:9] ADMA Error Status Enable. - ADMA_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit TUNING_ERR_STAT_EN:1;    /**< \brief [10:10] Tuning Error Status Enable. - TUNING_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit RESP_ERR_STAT_EN:1;    /**< \brief [11:11] Response Error Status Enable (SD Mode only) - RESP_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit BOOT_ACK_ERR_STAT_EN:1;    /**< \brief [12:12] Boot Acknowledgment Error (eMMC Mode only). - BOOT_ACK_ERR_STAT_EN (rw) */
    Ifx_UReg_16Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_16Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_ERROR_INT_STAT_EN_Bits;

/** \brief Force Event Register for Auto CMD Error Status register */
typedef struct _Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits
{
    Ifx_UReg_16Bit FORCE_AUTO_CMD12_NOT_EXEC:1;    /**< \brief [0:0] Force Event for Auto CMD12 Not Executed - FORCE_AUTO_CMD12_NOT_EXEC (w) */
    Ifx_UReg_16Bit FORCE_AUTO_CMD_TOUT_ERR:1;    /**< \brief [1:1] Force Event for Auto CMD Timeout Error - FORCE_AUTO_CMD_TOUT_ERR (w) */
    Ifx_UReg_16Bit FORCE_AUTO_CMD_CRC_ERR:1;    /**< \brief [2:2] Force Event for Auto CMD CRC Error - FORCE_AUTO_CMD_CRC_ERR (w) */
    Ifx_UReg_16Bit FORCE_AUTO_CMD_EBIT_ERR:1;    /**< \brief [3:3] Force Event for Auto CMD End Bit Error - FORCE_AUTO_CMD_EBIT_ERR (w) */
    Ifx_UReg_16Bit FORCE_AUTO_CMD_IDX_ERR:1;    /**< \brief [4:4] Force Event for Auto CMD Index Error - FORCE_AUTO_CMD_IDX_ERR (w) */
    Ifx_UReg_16Bit FORCE_AUTO_CMD_RESP_ERR:1;    /**< \brief [5:5] Force Event for Auto CMD Response Error - FORCE_AUTO_CMD_RESP_ERR (w) */
    Ifx_UReg_16Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_16Bit FORCE_CMD_NOT_ISSUED_AUTO_CMD12:1;    /**< \brief [7:7] Force Event for Command Not Issued By Auto CMD12 Error - FORCE_CMD_NOT_ISSUED_AUTO_CMD12 (w) */
    Ifx_UReg_16Bit reserved_8:8;      /**< \brief [15:8] \internal Reserved */
} Ifx_SDMMC_FORCE_AUTO_CMD_STAT_Bits;

/** \brief Force Event Register for Error Interrupt Status */
typedef struct _Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits
{
    Ifx_UReg_16Bit FORCE_CMD_TOUT_ERR:1;    /**< \brief [0:0] Force Event for Command Timeout Error (SD/eMMC Mode only) - FORCE_CMD_TOUT_ERR (w) */
    Ifx_UReg_16Bit FORCE_CMD_CRC_ERR:1;    /**< \brief [1:1] Force Event for Command CRC Error (SD/eMMC Mode only) - FORCE_CMD_CRC_ERR (w) */
    Ifx_UReg_16Bit FORCE_CMD_END_BIT_ERR:1;    /**< \brief [2:2] Force Event for Command End Bit Error (SD/eMMC Mode only) - FORCE_CMD_END_BIT_ERR (w) */
    Ifx_UReg_16Bit FORCE_CMD_IDX_ERR:1;    /**< \brief [3:3] Force Event for Command Index Error (SD/eMMC Mode only) - FORCE_CMD_IDX_ERR (w) */
    Ifx_UReg_16Bit FORCE_DATA_TOUT_ERR:1;    /**< \brief [4:4] Force Event for Data Timeout Error (SD/eMMC Mode only) - FORCE_DATA_TOUT_ERR (w) */
    Ifx_UReg_16Bit FORCE_DATA_CRC_ERR:1;    /**< \brief [5:5] Force Event for Data CRC Error (SD/eMMC Mode only) - FORCE_DATA_CRC_ERR (w) */
    Ifx_UReg_16Bit FORCE_DATA_END_BIT_ERR:1;    /**< \brief [6:6] Force Event for Data End Bit Error (SD/eMMC Mode only) - FORCE_DATA_END_BIT_ERR (w) */
    Ifx_UReg_16Bit FORCE_CUR_LMT_ERR:1;    /**< \brief [7:7] Force Event for Current Limit Error - FORCE_CUR_LMT_ERR (w) */
    Ifx_UReg_16Bit FORCE_AUTO_CMD_ERR:1;    /**< \brief [8:8] Force Event for Auto CMD Error (SD/eMMC Mode only) - FORCE_AUTO_CMD_ERR (w) */
    Ifx_UReg_16Bit FORCE_ADMA_ERR:1;    /**< \brief [9:9] Force Event for ADMA Error - FORCE_ADMA_ERR (w) */
    Ifx_UReg_16Bit FORCE_TUNING_ERR:1;    /**< \brief [10:10] Force Event for Tuning Error - FORCE_TUNING_ERR (w) */
    Ifx_UReg_16Bit FORCE_RESP_ERR:1;    /**< \brief [11:11] Force Event for Response Error (SD Mode only) - FORCE_RESP_ERR (w) */
    Ifx_UReg_16Bit FORCE_BOOT_ACK_ERR:1;    /**< \brief [12:12] Force Event for Boot Ack error. - FORCE_BOOT_ACK_ERR (w) */
    Ifx_UReg_16Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_16Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_16Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
} Ifx_SDMMC_FORCE_ERROR_INT_STAT_Bits;

/** \brief Host Controller Version */
typedef struct _Ifx_SDMMC_HOST_CNTRL_VERS_Bits
{
    Ifx_UReg_16Bit SPEC_VERSION_NUM:8;    /**< \brief [7:0] Specification Version Number - SPEC_VERSION_NUM (r) */
    Ifx_UReg_16Bit VENDOR_VERSION_NUM:8;    /**< \brief [15:8] Vendor Version Number - VENDOR_VERSION_NUM (r) */
} Ifx_SDMMC_HOST_CNTRL_VERS_Bits;

/** \brief Host Control 1 Register */
typedef struct _Ifx_SDMMC_HOST_CTRL1_Bits
{
    Ifx_UReg_8Bit LED_CTRL:1;         /**< \brief [0:0] LED Control - LED_CTRL (rw) */
    Ifx_UReg_8Bit DAT_XFER_WIDTH:1;    /**< \brief [1:1] Data Transfer Width (SD/eMMC Mode only) - DAT_XFER_WIDTH (rw) */
    Ifx_UReg_8Bit HIGH_SPEED_EN:1;    /**< \brief [2:2] High Speed Enable (SD/eMMC Mode only) - HIGH_SPEED_EN (rw) */
    Ifx_UReg_8Bit DMA_SEL:2;          /**< \brief [4:3] DMA Select - DMA_SEL (rw) */
    Ifx_UReg_8Bit EXT_DAT_XFER:1;     /**< \brief [5:5] Extended Data Transfer Width (Embedded and an SD/eMMC Mode only) - EXT_DAT_XFER (rw) */
    Ifx_UReg_8Bit CARD_DETECT_TEST_LVL:1;    /**< \brief [6:6] Card Detect Test Level - CARD_DETECT_TEST_LVL (rw) */
    Ifx_UReg_8Bit CARD_DETECT_SIG_LVL:1;    /**< \brief [7:7] Card Detect Signal Selection - CARD_DETECT_SIG_LVL (rw) */
} Ifx_SDMMC_HOST_CTRL1_Bits;

