zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxSdmmc_regdef.h
/** \brief Kernel Reset Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_KRST0_Bits B;           /**< \brief Bitfield access */
} Ifx_SDMMC_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_KRST1_Bits B;           /**< \brief Bitfield access */
} Ifx_SDMMC_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_KRSTCLR_Bits B;         /**< \brief Bitfield access */
} Ifx_SDMMC_KRSTCLR;

/** \brief DMA burst control register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_MBIU_CTRL_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_MBIU_CTRL;

/** \brief MSHC version   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_MSHC_VER_ID_Bits B;     /**< \brief Bitfield access */
} Ifx_SDMMC_MSHC_VER_ID;

/** \brief MSHC version type   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_MSHC_VER_TYPE_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_MSHC_VER_TYPE;

/** \brief Normal Interrupt Signal Enable Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_NORMAL_INT_SIGNAL_EN_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_NORMAL_INT_SIGNAL_EN;

/** \brief Normal Interrupt Status Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_NORMAL_INT_STAT_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_NORMAL_INT_STAT;

/** \brief Normal Interrupt Status Enable Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_NORMAL_INT_STAT_EN;

/** \brief Preset Value for Default Speed   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_PRESET_DS_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_PRESET_DS;

/** \brief Preset Value for High Speed   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_PRESET_HS_Bits B;       /**< \brief Bitfield access */
} Ifx_SDMMC_PRESET_HS;

/** \brief Preset Value for Initialization   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_PRESET_INIT_Bits B;     /**< \brief Bitfield access */
} Ifx_SDMMC_PRESET_INIT;

/** \brief Present State Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_PSTATE_REG_Bits B;      /**< \brief Bitfield access */
} Ifx_SDMMC_PSTATE_REG;

/** \brief Power Control Register   */
typedef union
{
    Ifx_UReg_8Bit U;                  /**< \brief Unsigned access */
    Ifx_SReg_8Bit I;                  /**< \brief Signed access */
    Ifx_SDMMC_PWR_CTRL_Bits B;        /**< \brief Bitfield access */
} Ifx_SDMMC_PWR_CTRL;

/** \brief Pointer for Vendor Specific Area 2   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_P_VENDOR2_SPECIFIC_AREA;

/** \brief Pointer for Vendor Specific Area 1   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_P_VENDOR_SPECIFIC_AREA;

/** \brief Response Register 01   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_RESP01_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_RESP01;

/** \brief Response Register 23   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_RESP23_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_RESP23;

/** \brief Response Register 45   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_RESP45_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_RESP45;

/** \brief Response Register 67   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_RESP67_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_RESP67;

/** \brief SDMA System Address register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_SDMASA_Bits B;          /**< \brief Bitfield access */
} Ifx_SDMMC_SDMASA;

/** \brief Slot Interrupt Status Register   */
typedef union
{
    Ifx_UReg_16Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_16Bit I;                 /**< \brief Signed access */
    Ifx_SDMMC_SLOT_INTR_STATUS_Bits B;    /**< \brief Bitfield access */
} Ifx_SDMMC_SLOT_INTR_STATUS;

